In [1]:
import pandas. as p
import numpy as n

In [50]:
s=n.arange(1,200,dtype='i1')

In [56]:
f=n.array([1,2,3])

In [114]:
x = n.array([(98,97,99),(70,76,68)],dtype=[('a','i1'),('b','i1'),('c','i1')])

In [117]:
x.tostring().decode("ascii")

'bacFLD'

In [116]:
n.array([98,97,99],dtype='i1').tostring().decode("ascii")

'bac'

In [4]:
df=p.read_csv('carprices.csv')

In [5]:
df

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [21]:
df.iloc[0:4,-1::-1].describe()

       Age(yrs)  Sell Price($)       Mileage
count  4.000000       4.000000      4.000000
mean   4.000000   29525.000000  45875.000000
std    1.825742    9562.208601  21001.488043
min    2.000000   18000.000000  22500.000000
25%    2.750000   24075.000000  31875.000000
50%    4.000000   30050.000000  46000.000000
75%    5.250000   35500.000000  60000.000000
max    6.000000   40000.000000  69000.000000

In [22]:
print(4/6.000000) 
print(30050/40000.000000)
print(46000/69000.000000)

0.6666666666666666
0.75125
0.6666666666666666

In [ ]:
7